AsierBolinaga/ade9000/mcuxpresso/source/board/pin_mux.c
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MIMXRT1062xxxxA
package_id: MIMXRT1062DVL6A
mcu_data: ksdk2_0
processor_version: 7.0.1
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

typedef struct BOARD_not_connected_pin
{
	int32_t 	muxRegister;
	uint32_t	muxMode;
	uint32_t	inputRegister;
	uint32_t	inputDaisy;
	uint32_t	configRegister;
	GPIO_Type*	base;
	uint32_t	gpio_pin;
}BOARD_not_connected_pin_t;

enum BOARD_not_conn_pin_list
{
	GPIO_AD_B0_00, 	/* not connected */
	GPIO_AD_B0_01, 	/* not connected */
	GPIO_AD_B0_11, 	/* not connected */
	GPIO_AD_B0_14, 	/* not connected */
	GPIO_AD_B1_08, 	/* not connected */
	GPIO_B0_04,		/* not connected TODO PMODA I2C proposal*/
	GPIO_B0_05,		/* not connected TODO PMODA I2C proposal*/
	GPIO_B0_06,		/* not connected */
	GPIO_B0_07,		/* not connected */
	GPIO_B0_08,		/* not connected */
	GPIO_B0_09,		/* not connected */
	GPIO_B1_02,		/* not connected */
	GPIO_B1_12,		/* not connected */
	GPIO_B1_13,		/* not connected */
	GPIO_AD_B0_08,	/* PMODB_IRQ0, not used */
	GPIO_AD_B0_12,	/* PMODA_I2C_SCL, not used (FUTURE PPS proposal) TODO */
	GPIO_AD_B0_13,	/* PMODA_I2C_SDA, not used (not connected proposal))*/
	GPIO_AD_B1_00,	/* FP_I2C_SDA, not used */
	GPIO_AD_B1_01,	/* FP_I2C_SCL, not used */
	GPIO_AD_B1_02,	/* PMODB_RSTn, not used */
	GPIO_AD_B1_06,	/* PMODB_I2C_SDA, not used */
	GPIO_AD_B1_07,	/* PMODB_I2C_SCL, not used */
	GPIO_AD_B1_10,	/* DEVB_UART_TXD, not used */
	GPIO_AD_B1_11,	/* DEVB_UART_RXD, not used */
#ifndef DEBUG_PIN
	GPIO_AD_B1_12,	/* DEVB_SPI_CS1n, not used. Used as debug pin when DEBUG_PIN is active */
#endif
	GPIO_AD_B1_13,	/* DEVB_SPI_MISO, not used */
	GPIO_AD_B1_14,	/* DEVB_SPI_MOSI, not used */
	GPIO_AD_B1_15,	/* DEVB_SPI_SCK, not used */
	NOT_CONN_GPIO_NUM
};

static BOARD_not_connected_pin_t BOARD_not_conn_pins[NOT_CONN_GPIO_NUM] =
{
	{IOMUXC_GPIO_AD_B0_00_GPIO1_IO00, GPIO1,  0},
	{IOMUXC_GPIO_AD_B0_01_GPIO1_IO01, GPIO1,  1},
	{IOMUXC_GPIO_AD_B0_11_GPIO1_IO11, GPIO1, 11},
	{IOMUXC_GPIO_AD_B0_14_GPIO1_IO14, GPIO1, 14},
	{IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, GPIO1, 24},
	{IOMUXC_GPIO_B0_04_GPIO2_IO04, 	  GPIO2,  4},
	{IOMUXC_GPIO_B0_05_GPIO2_IO05, 	  GPIO2,  5},
	{IOMUXC_GPIO_B0_06_GPIO2_IO06, 	  GPIO2,  6},
	{IOMUXC_GPIO_B0_07_GPIO2_IO07, 	  GPIO2,  7},
	{IOMUXC_GPIO_B0_08_GPIO2_IO08, 	  GPIO2,  8},
	{IOMUXC_GPIO_B0_09_GPIO2_IO09, 	  GPIO2,  9},
	{IOMUXC_GPIO_B1_02_GPIO2_IO18, 	  GPIO2, 18},
	{IOMUXC_GPIO_B1_12_GPIO2_IO28, 	  GPIO2, 28},
	{IOMUXC_GPIO_B1_13_GPIO2_IO29, 	  GPIO2, 29},
	{IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, GPIO1,  8},
	{IOMUXC_GPIO_AD_B0_12_GPIO1_IO12, GPIO1, 12},
	{IOMUXC_GPIO_AD_B0_13_GPIO1_IO13, GPIO1, 13},
	{IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, GPIO1, 16},
	{IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, GPIO1, 17},
	{IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, GPIO1, 18},
	{IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, GPIO1, 22},
	{IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, GPIO1, 23},
	{IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, GPIO1, 26},
	{IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, GPIO1, 27},
#ifndef DEBUG_PIN
	{IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, GPIO1, 28},
#endif
	{IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, GPIO1, 29},
	{IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, GPIO1, 30},
	{IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, GPIO1, 31}
};

static void BOARD_Init_not_connected_pins(void);

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();

    BOARD_Init_not_connected_pins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) 
{
#if defined(ADSN4) || defined (ADSN_SBL)
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

#ifdef DEBUG_PIN
  /* DEBUG pin */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0xB0A9U);
#endif

  /* PMODA_RSTn */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0xB0A9U);

  /* LED_USER */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0x10B0U);
  /* LED_USER_ENABLE */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0x10B0U);

  /* PMODA_IRQ0 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_ENET_1588_EVENT2_IN, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_ENET_1588_EVENT2_IN, 0x10B0U);
  /* PMODA_IRQ1 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_15_ENET_1588_EVENT0_IN, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_15_ENET_1588_EVENT0_IN, 0x10B0U);

  /* PMODA_SPI */
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_00_LPSPI4_PCS0, 0U); 	/* PMODA_SPI_CS1n */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_00_LPSPI4_PCS0, 0x10B0U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_01_LPSPI4_SDI, 0U);	/* PMODA_SPI_MISO */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_01_LPSPI4_SDI, 0x10B0U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_02_LPSPI4_SDO, 0U);	/* PMODA_SPI_MOSI */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_02_LPSPI4_SDO, 0x10B0U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_03_LPSPI4_SCK, 0U);	/* PMODA_SPI_SCK */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_03_LPSPI4_SCK, 0x10B0U);

  /* DEVA_UART */
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_LPUART6_TX, 0U);		/* DEVA_UART_TXD */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_LPUART6_TX,0x10B0U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_LPUART6_RX, 0U);		/* DEVA_UART_RXD */
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_LPUART6_RX,0x10B0U);

  /* ENET RMII */
  /* PHY_RSTn */
  gpio_pin_config_t PHY_RST_config = {
	  .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_14 (pin E10) */
  GPIO_PinInit(GPIO2, 14U, &PHY_RST_config);

