AsierBolinaga/ade9000/mcuxpresso/source/board/pin_mux.c
  IOMUXC_SetPinConfig(
       IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03,   /* GPIO_SD_B1_00 PAD functional properties : */
       0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02,   /* GPIO_SD_B1_01 PAD functional properties : */
      0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01,   /* GPIO_SD_B1_02 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00,   /* GPIO_SD_B1_03 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK,     /* GPIO_SD_B1_04 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 PAD functional properties : */
     0x0130F1u);                             /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Pull
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
     IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 PAD functional properties : */
     0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: max(200MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */

 IOMUXC_SetPinConfig(
	IOMUXC_GPIO_AD_B1_02_ENET_1588_EVENT2_OUT,		/* GPIO_AD_B0_12 PAD functional properties : */
	0x10B0u);								/* Slew Rate Field: Slow Slew Rate
											   Drive Strength Field: R0/6
											   Speed Field: medium(100MHz)
											   Open Drain Enable Field: Open Drain Disabled
											   Pull / Keep Enable Field: Pull/Keeper Enabled
											   Pull / Keep Select Field: Keeper
											   Pull Up / Down Config. Field: 100K Ohm Pull Down
											   Hyst. Enable Field: Hysteresis Disabled */

#else
#error ERROR! Valid platform not defined
#endif
}

static void BOARD_Init_not_connected_pins(void)
{
	gpio_pin_config_t input_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode}; /* pins not used are configured as digital output, lvl 0 */

	for(uint32_t pin_index = 0; pin_index < NOT_CONN_GPIO_NUM; pin_index++)
	{
		IOMUXC_SetPinMux(BOARD_not_conn_pins[pin_index].muxRegister,
					     BOARD_not_conn_pins[pin_index].muxMode,
						 BOARD_not_conn_pins[pin_index].inputRegister,
						 BOARD_not_conn_pins[pin_index].inputDaisy,
						 BOARD_not_conn_pins[pin_index].configRegister,
						 0);

		IOMUXC_SetPinConfig(BOARD_not_conn_pins[pin_index].muxRegister,
			     	 	    BOARD_not_conn_pins[pin_index].muxMode,
				 	 	 	BOARD_not_conn_pins[pin_index].inputRegister,
							BOARD_not_conn_pins[pin_index].inputDaisy,
							BOARD_not_conn_pins[pin_index].configRegister,
							IOMUXC_SW_PAD_CTL_PAD_PUS(0b10) |
							IOMUXC_SW_PAD_CTL_PAD_PUE(1)  |
							IOMUXC_SW_PAD_CTL_PAD_HYS(0));

		GPIO_PinInit(BOARD_not_conn_pins[pin_index].base, BOARD_not_conn_pins[pin_index].gpio_pin, &input_config);
	}
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
